Tekla.Structures.Model.Object
The Object class is an abstract base class for all the objects Tekla Structures has.

Tekla.Structures.Model.Object.Identifier
The identifier of the object.

Tekla.Structures.Model.Object.#ctor
Initializes an object with a zero identifier.